# coding:utf-8
# @Author:宋显然

import os
import time
import pyttsx3

"""
牛马论 佚名

夫牲畜者，乃耕或工者也。予谓牛耕时虽长而耐虽久，然其速慢也。马者其速虽快，俄而息。驴也，其速、时均优而其性劣，常以其后足以攻人矣。豕者，好吃也，其食之多而无实干之能，烹之乃可利于人，岂以是为良之牲畜也？其更需良地以居，人之照料，无可生长之迅速，可谓劣之牲畜也！
予谓牲畜之优者，牛马也。其俱牛与马之精华，去马与牛之糟粕，不休不停，迅而品之优矣。其食少，毋须良屋以居，良草以食，亦可体格庞大，若有瘟疫者，乃方自愈，烹则味美，岂非一优之牲畜者也？性温，亦可听命于人，岂非优良牲畜之品性者邪？
世间或以是牛马者为牛奶也，乃易纯牛奶为纯牛马，以增笑耳。然则其视牛马者以子虚乌有，其孤陋寡闻者乃更乐也，余以为不然。
嗟乎，此牛马者非此牛奶也，乃此天下之民矣！其王、佃者何能休之矣！亭长告余曰：“此谓牛马也！乾坤之未定，你我皆为牛马！”古人亦云：“且壮士不死则已，一死即举大名耳，王侯将相宁有种乎！”
"""

engine = pyttsx3.init()
engine.setProperty('rate', 220)
engine.setProperty('volume', 0.8)
print("大家好，我是某个不知名的某人（）从某地搞来的人工智力障碍**，他让我读一下他写的某个东西。")
pyttsx3.speak('大家好，我是某个不知名的某人从某地搞来的人工智力。。。。牛马，他让我读一下他写的某个东西。')
print("无题 佚名")
pyttsx3.speak('无题 佚名')
print("搞错了，再来")
pyttsx3.speak('搞错了，再来')
os.system("cls")
engine.setProperty('rate', 150)
print("                             牛马论 佚名")
pyttsx3.speak('牛马论，，佚名')
time.sleep(0.5)
print("    夫牲畜者，乃耕或工者也。予谓牛耕时虽长而耐虽久，然其速慢也。马者其速虽快，俄而息。驴也，其速、时均优而其性劣，常以其后足以攻人矣。\
豕者，好吃也，其食之多而无实干之能，烹之乃可利于人，岂以是为良之牲畜也？其更需良地以居，人之照料，无可生长之迅速，可谓劣之牲畜也！")
pyttsx3.speak('夫牲畜者，乃耕或工者也。予谓牛耕时虽长而耐虽久，然其速慢也。马者其速虽快，俄而息。驴也，其速、时均优而其性劣，常以其后足以攻人矣。豕者，\
浩吃也，其食之多而无实干之能，烹之乃可利于人，岂以是为良之牲畜也？其更需良第以居，人之照料，无可生长之迅速，可谓劣之牲畜也！')
time.sleep(0.3)
print("    予谓牲畜之优者，牛马也。其俱牛与马之精华，去马与牛之糟粕，不休不停，迅而品之优矣。其食少，毋须良屋以居，良草以食，亦可体格庞大，若有瘟疫\
者，乃方自愈，烹则味美，岂非一优之牲畜者也？性温，亦可听命于人，岂非优良牲畜之品性者邪？")
pyttsx3.speak('予谓牲畜之优者，牛马也。其俱牛与马之精华，去马与牛之糟粕，不休不停，迅而品之优矣。其食少，毋须良屋以居，良草以食，亦可体格庞大，若有瘟疫者\
，乃方自愈，烹则味美，岂非一优之牲畜者也？性温，亦可听命于人，岂非优良牲畜之品性者爷？')
time.sleep(0.3)
print("    世间或以是牛马者为牛奶也，乃易纯牛奶为纯牛马，以增笑耳。然则其视牛马者以子虚乌有，其孤陋寡闻者乃更乐也，余以为不然。")
pyttsx3.speak('世间或以是牛马者为牛奶也，乃易纯牛奶为纯牛马，以增笑耳。然则其视牛马者以子虚乌有，其孤陋寡闻者乃更乐也，余以为不然。')
time.sleep(0.3)
print("    嗟乎，此牛马者非此牛奶也，乃此天下之民矣！其王、佃者何能休之矣！亭长告余曰：“此谓牛马也！乾坤之未定，你我皆为牛马！”古人亦云：“且\
壮士不死则已，一死即举大名耳，王侯将相宁有种乎！”")
pyttsx3.speak('嗟乎，此牛马者非此牛奶也，乃此天下之民矣！其王、佃者何能休之矣！亭长告余曰：“此谓牛马也！乾坤之未定，你我皆为牛马！”古人亦云：\
“且壮士不死则已，一死即举大名耳，王侯酱象宁有种乎！”')
input()